<template>
  <AppMain class="main--about">
    <AppCooperate :list="cooperateList" />
  </AppMain>
</template>

<script setup>
import AppMain from '@/components/AppMain.vue';
import AppCooperate from '@/components/AppCooperate.vue';
import { reactive } from 'vue';

const cooperateList = reactive([
  {
    content: `
      <p>
        Ищете возможность зарабатывать с надежным представителем лучших европейских
        брендов?
      </p>
      <p>
        Компания TerraRoof всегда готова к сотрудничеству с дилерами по всему Казахстану.
        Мы предлагаем: 
      </p>
      <ul>
        <li>работу с премиальным сегментом рынка</li>
        <li>
          лучшие продукты на рынке по ценам производителей (например, Metrotile – бренд №1
          среди композитной черепицы в мире) 
        </li>
        <li>
          полное маркетинговое сопровождение: расскажем о всех инструментах продвижения и
          привлечения клиентов 
        </li>
        <li>надежность и гарантированные сроки поставок</li>
      </ul>
      <p>Оставляйте заявки, будем развиваться вместе!</p>`,
    img: 'cooperate/1.jpg',
    btnText: 'Стать диллером'
  },
  {
    title: 'Архитекторам',
    content: `
      <p>В поиске профессионального подрядчика по кровельным работам? Хотите реализовать
          нестандартный проект, но не можете найти достойных экспертов?</p>
      <p>Компания TerraRoof готова к сотрудничеству на самых сложных объектах и в самые
        сжатые сроки. Наши договорные обязательства никогда не нарушаются. </p>
      <p>Давайте обсудим условия сотрудничества?</p>`,
    img: 'cooperate/2.jpg',
    btnText: 'Для архитекторов'
  },
  {
    title: 'Кровельщикам',
    content: `
      <p>TerraRoof постоянно растет и развивается, поэтому мы всегда готовы предложить
        работу достойным специалистам. </p>
      <p>Помимо конкурентной заработной платы, мы гарантируем постоянное развитие -
        повышение квалификации и обучение от лучших мировых производителей. </p>
      <p>Оставьте заявку, и наш специалист по кадрам свяжется с вами!</p>`,
    img: 'cooperate/3.jpg',
    btnText: 'Кровельщикам'
  }
]);
</script>
